In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("./data/iris_missing.csv")

In [4]:
df.head(7)

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1          NaN           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2     NaN
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2     NaN
5           5.4          3.9           1.7          0.4  setosa
6           NaN          NaN           NaN          NaN  setosa

In [5]:
df_na=df.head(7)

In [6]:
df_na

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1          NaN           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2     NaN
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2     NaN
5           5.4          3.9           1.7          0.4  setosa
6           NaN          NaN           NaN          NaN  setosa

In [8]:
df.isna()

     Sepal_Length  Sepal_Width  Petal_Length  Petal_Width  Species
0           False         True          True        False    False
1           False        False         False        False    False
2           False        False         False        False     True
3           False        False         False        False    False
4           False        False         False        False     True
..            ...          ...           ...          ...      ...
145         False        False         False        False    False
146          True        False          True         True    False
147         False        False         False        False    False
148         False        False         False        False    False
149         False        False         False         True    False

[150 rows x 5 columns]

In [10]:
df_na["Sepal_Length"].isna()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
Name: Sepal_Length, dtype: bool

In [11]:
True+True+False

2

In [12]:
df_na["Sepal_Length"].isna().sum()

1

In [13]:
df_na.isna()

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width  Species
0         False         True          True        False    False
1         False        False         False        False    False
2         False        False         False        False     True
3         False        False         False        False    False
4         False        False         False        False     True
5         False        False         False        False    False
6          True         True          True         True    False

In [21]:
df_na.isna().sum() #각 변수별(column) 결측치 개수

Sepal_Length    1
Sepal_Width     2
Petal_Length    2
Petal_Width     1
Species         2
dtype: int64

In [22]:
df_na.isna().sum(axis=1) #각 row 결측치 개수

0    2
1    0
2    1
3    0
4    1
5    0
6    4
dtype: int64

In [23]:
df_na.isna().sum(axis=0) #각 변수별(column) 결측치 개수

Sepal_Length    1
Sepal_Width     2
Petal_Length    2
Petal_Width     1
Species         2
dtype: int64

In [24]:
df_na

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1          NaN           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2     NaN
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2     NaN
5           5.4          3.9           1.7          0.4  setosa
6           NaN          NaN           NaN          NaN  setosa

In [26]:
df_na.fillna(value={"Sepal_Length":999})

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1          NaN           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2     NaN
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2     NaN
5           5.4          3.9           1.7          0.4  setosa
6         999.0          NaN           NaN          NaN  setosa

In [28]:
df_na.fillna(value={"Sepal_Length":999, "Sepal_Width":999})

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1        999.0           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2     NaN
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2     NaN
5           5.4          3.9           1.7          0.4  setosa
6         999.0        999.0           NaN          NaN  setosa

In [69]:
df_na.shape[0]

7

In [72]:
df_na.iloc[:,:df_na.shape[1]-1]

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width
0           5.1          NaN           NaN          0.2
1           4.9          3.0           1.4          0.2
2           4.7          3.2           1.3          0.2
3           4.6          3.1           1.5          0.2
4           5.0          3.6           1.4          0.2
5           5.4          3.9           1.7          0.4
6           NaN          NaN           NaN          NaN

In [73]:
df_na.iloc[:,:df_na.shape[1]-1].sum()

Sepal_Length    29.7
Sepal_Width     16.8
Petal_Length     7.3
Petal_Width      1.4
dtype: float64

In [81]:
df_na.iloc[:,:df_na.shape[1]-1].mean()

Sepal_Length    4.950000
Sepal_Width     3.360000
Petal_Length    1.460000
Petal_Width     0.233333
dtype: float64

In [85]:
df_na.iloc[:,:df_na.shape[1]-1].mean().shape

(4,)

In [86]:
df_na.iloc[:,:df_na.shape[1]-1].mean()[0]

4.949999999999999

In [87]:
len(df_na.iloc[:,:df_na.shape[1]-1].mean())

4

In [95]:
df_na.iloc[:,:df_na.shape[1]-1].mean().index[0]

'Sepal_Length'

In [102]:
df_na_ser_mean = df_na.iloc[:,:df_na.shape[1]-1].mean()

In [103]:
df_na.fillna(value =df_na_ser_mean)

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0          5.10         3.36          1.46     0.200000  setosa
1          4.90         3.00          1.40     0.200000  setosa
2          4.70         3.20          1.30     0.200000     NaN
3          4.60         3.10          1.50     0.200000  setosa
4          5.00         3.60          1.40     0.200000     NaN
5          5.40         3.90          1.70     0.400000  setosa
6          4.95         3.36          1.46     0.233333  setosa

In [104]:
print(df_na_ser_mean)

Sepal_Length    4.950000
Sepal_Width     3.360000
Petal_Length    1.460000
Petal_Width     0.233333
dtype: float64

In [105]:
df_na

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1          NaN           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2     NaN
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2     NaN
5           5.4          3.9           1.7          0.4  setosa
6           NaN          NaN           NaN          NaN  setosa

In [110]:
df_na_ser_mean["Species"] = "setosa"

In [111]:
df_na_ser_mean

Sepal_Length        4.95
Sepal_Width         3.36
Petal_Length        1.46
Petal_Width     0.233333
Species           setosa
dtype: object

In [112]:
df_na.fillna(value =df_na_ser_mean)

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0          5.10         3.36          1.46     0.200000  setosa
1          4.90         3.00          1.40     0.200000  setosa
2          4.70         3.20          1.30     0.200000  setosa
3          4.60         3.10          1.50     0.200000  setosa
4          5.00         3.60          1.40     0.200000  setosa
5          5.40         3.90          1.70     0.400000  setosa
6          4.95         3.36          1.46     0.233333  setosa

In [113]:
df_na_plus = df_na.fillna(value =df_na_ser_mean)

In [114]:
df_na_plus

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0          5.10         3.36          1.46     0.200000  setosa
1          4.90         3.00          1.40     0.200000  setosa
2          4.70         3.20          1.30     0.200000  setosa
3          4.60         3.10          1.50     0.200000  setosa
4          5.00         3.60          1.40     0.200000  setosa
5          5.40         3.90          1.70     0.400000  setosa
6          4.95         3.36          1.46     0.233333  setosa

In [115]:
df_na

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1          NaN           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2     NaN
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2     NaN
5           5.4          3.9           1.7          0.4  setosa
6           NaN          NaN           NaN          NaN  setosa

In [116]:
df_na.dropna()

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
1           4.9          3.0           1.4          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa

In [117]:
df_na.dropna(how="all")

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1          NaN           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2     NaN
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2     NaN
5           5.4          3.9           1.7          0.4  setosa
6           NaN          NaN           NaN          NaN  setosa

In [119]:
df_na.iloc[:,:-1].dropna(how="all") #iloc 마지막 열 제거 방법 iloc[:,:-1]

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width
0           5.1          NaN           NaN          0.2
1           4.9          3.0           1.4          0.2
2           4.7          3.2           1.3          0.2
3           4.6          3.1           1.5          0.2
4           5.0          3.6           1.4          0.2
5           5.4          3.9           1.7          0.4

In [122]:
print(df["Sepal_Length"].max())
print(df["Sepal_Length"].min())
print(df["Sepal_Length"].mean())

7.9
4.3
5.8538461538461535

In [123]:
df["Sepal_Length"].median()

5.8

In [124]:
df["Sepal_Length"].quantile()

5.8

In [127]:
print(df["Sepal_Length"].quantile(q=0.25)) #0.25는 제 1 사분위수
print(df["Sepal_Length"].quantile(q=0.50)) #0.50는 제 2 사분위수
print(df["Sepal_Length"].quantile(q=0.75)) #0.75는 제 3 사분위수
#IQR = .quantile(q=0.75) - .quantile(q=0.25)

5.1
5.8
6.4

In [134]:
df.iloc[:,:-1].isna().sum().sum()

40

In [137]:
df["Sepal_Width"].fillna(value = df["Sepal_Width"].mean()).var()

0.17561945818840946

In [148]:
print(df["Sepal_Length"]>(df["Sepal_Length"].mean()+(df["Sepal_Length"].std())*1.5))

0      False
1      False
2      False
3      False
4      False
       ...
145    False
146    False
147    False
148    False
149    False
Name: Sepal_Length, Length: 150, dtype: bool

In [144]:
df["Sepal_Length"].std()*1.5

1.2353639350427605

In [164]:
upper = (df["Sepal_Length"]>(df["Sepal_Length"].mean()+(df["Sepal_Length"].std())*1.5)).sum()
lower = (df["Sepal_Length"]<(df["Sepal_Length"].mean()-(df["Sepal_Length"].std())*1.5)).sum()

In [165]:
print(upper, lower)

12 7

In [187]:
df = pd.read_csv("data/iris.csv")

In [190]:
df

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [191]:
is_mean = df["Sepal.Length"].mean()

In [192]:
is_std = df["Sepal.Length"].std()

In [195]:
is_std_mul = is_std*1.5

In [196]:
upper_str = df["Sepal.Length"]>is_mean+is_std_mul

In [197]:
sum(upper_str)

12

In [198]:
lower_str = df["Sepal.Length"]<is_mean-is_std_mul

In [199]:
sum(lower_str)

9

In [200]:
len(df.loc[upper_str|lower_str],)

21